[
  {
    "word": "Synergy",
    "description": "The combined effect of teamwork that is greater than individual efforts."
  },
  {
    "word": "KPI",
    "description": "Key Performance Indicator; a measurable value that shows success in achieving objectives."
  },
  {
    "word": "ROI",
    "description": "Return on Investment; a metric to evaluate the efficiency of an investment."
  },
  {
    "word": "Agile",
    "description": "A flexible project management approach focused on iterative development and collaboration."
  },
  {
    "word": "Scrum",
    "description": "An agile framework that structures team roles, events, and artifacts in short cycles."
  },
  {
    "word": "Stakeholder",
    "description": "Anyone impacted by or invested in a project’s success or outcomes."
  },
  {
    "word": "Deliverable",
    "description": "A specific output or item that must be completed and delivered in a project."
  },
  {
    "word": "Milestone",
    "description": "A major progress point or goal achieved in the timeline of a project."
  },
  {
    "word": "Leverage",
    "description": "To strategically use resources or advantages to maximize outcomes."
  },
  {
    "word": "Touchpoint",
    "description": "Any interaction a customer has with your brand or product."
  },
  {
    "word": "Onboarding",
    "description": "The process of integrating new employees or customers into a system or organization."
  },
  {
    "word": "Strategy",
    "description": "A high-level plan to achieve long-term goals or competitive advantage."
  },
  {
    "word": "Workflow",
    "description": "A defined sequence of steps or tasks to complete a specific process."
  },
  {
    "word": "Paradigm",
    "description": "A standard model or pattern of thinking that defines a way of working or understanding."
  },
  {
    "word": "Core Competency",
    "description": "An organization's key strength or defining capability that gives it a competitive edge."
  },
  {
    "word": "Disruption",
    "description": "A change that significantly alters or challenges traditional business practices."
  },
  {
    "word": "Roadmap",
    "description": "A strategic plan that outlines goals, milestones, and steps over time."
  },
  {
    "word": "Alignment",
    "description": "Ensuring teams or efforts are working toward the same vision or objectives."
  },
  {
    "word": "Engagement",
    "description": "The level of attention, commitment, or emotional involvement from customers or employees."
  },
  {
    "word": "Brainstorm",
    "description": "A creative thinking session to generate ideas or solve problems collaboratively."
  }
]
