[
  {
    "word": "Eiffel Tower",
    "description": "An iconic iron tower in Paris, France, and a global symbol of romance and architecture."
  },
  {
    "word": "Statue of Liberty",
    "description": "A colossal statue on Liberty Island in New York City, symbolizing freedom and democracy."
  },
  {
    "word": "Taj Mahal",
    "description": "A white marble mausoleum in India, built by Mughal emperor Shah Jahan in memory of his wife."
  },
  {
    "word": "Great Wall of China",
    "description": "An ancient series of fortifications stretching across China, built to protect against invasions."
  },
  {
    "word": "Machu Picchu",
    "description": "An ancient Incan city set high in the Andes Mountains of Peru, known for its archaeological beauty."
  },
  {
    "word": "Colosseum",
    "description": "A Roman amphitheater in Rome, Italy, used for gladiator contests and public spectacles."
  },
  {
    "word": "Pyramids of Giza",
    "description": "Ancient Egyptian pyramids located near Cairo, built as tombs for pharaohs."
  },
  {
    "word": "Big Ben",
    "description": "The nickname for the Great Bell of the clock at the Palace of Westminster in London."
  },
  {
    "word": "Burj Khalifa",
    "description": "The tallest building in the world, located in Dubai, UAE."
  },
  {
    "word": "Sydney Opera House",
    "description": "A world-renowned performing arts center in Sydney, Australia, known for its sail-like design."
  },
  {
    "word": "Mount Fuji",
    "description": "A sacred volcanic mountain in Japan, and the country's highest peak."
  },
  {
    "word": "Niagara Falls",
    "description": "A group of massive waterfalls on the US-Canada border, famous for their beauty and power."
  },
  {
    "word": "Santorini",
    "description": "A Greek island known for its whitewashed buildings, blue domes, and stunning sunsets."
  },
  {
    "word": "Grand Canyon",
    "description": "A vast and colorful canyon in Arizona, USA, carved by the Colorado River."
  },
  {
    "word": "Chichen Itza",
    "description": "A large pre-Columbian archaeological site in Mexico, featuring the famous step pyramid El Castillo."
  },
  {
    "word": "Stonehenge",
    "description": "A prehistoric monument in England consisting of a ring of standing stones."
  },
  {
    "word": "Christ the Redeemer",
    "description": "A giant statue of Jesus Christ in Rio de Janeiro, Brazil, overlooking the city from Mount Corcovado."
  },
  {
    "word": "Petra",
    "description": "An ancient rock-cut city in Jordan, famous for its rose-red sandstone architecture."
  },
  {
    "word": "Louvre",
    "description": "The world’s largest art museum in Paris, home to the Mona Lisa and other masterpieces."
  },
  {
    "word": "Angkor Wat",
    "description": "A massive temple complex in Cambodia, originally built as a Hindu temple for the Khmer Empire."
  }
]
